import datetime

t = int(input("Введіть тариф: "))
mb = int(input("Введіть кількість мегабайт, які ви витратили: "))

if t == 5000:
    if mb <= 5000:
        print("Ви повинні сплатити 85 грн.")
    else:
        print("Ви повинні сплатити " + str(85 + (mb - 5000) * 0.02) + " грн.")
elif t == 2000:
    if mb <= 2000:
        print("Ви повинні сплатити 35 грн.")
    else:
        print("Ви повинні сплатити " + str(35 + (mb - 2000) * 0.04) + " грн.")
        if mb > 5000:
            print("З тарифом 5000 ви маєте сплатити" + str(85 + (mb - 5000) * 0.02) + " грн")

elif t == 1000:
    if mb <= 1000:
        print("ви повинні сплатити 20 грн.")
    else:
        print("Ви повинні сплатити " + str(20 + (mb - 1000) * 0.05) + " грн")
        if mb > 5000:
            print("З тарифом 5000 ви маєте сплатити " + str(85 + (mb - 5000) * 0.02) + " грн")
        if mb > 2000:
            print("З тарифом 2000 ви маєте сплатити " + str(35 + (mb - 2000) * 0.04) + " грн.")

def printTimeStamp(name):
    print('Автор програми: ' + name)
    print('Час компіляції: ' + str(datetime.datetime.now()))

printTimeStamp("Team X")