print("""1 - Будинок
2 - Квартира
3 - Гуртожиток\n""")
h = int(input('Введіть місце проживання: '))
t = int(input('Введіть скільки годин ви приблизно знаходитесь дома:'))
if h == 3:
    if t <= 6:
        print("Мурашник")
    elif t >= 6:
        print("Риби")
elif  h == 2 and t <= 10:
    print("Хом'як")
elif h == 2 and t >= 10:
    print("Кішка")
elif h == 1 and t <= 10:
    print("Змія")
elif h == 1 and t >= 10 and t <= 17:
    print("Собака")
elif h == 1 and t >= 18:
    print("В’єтнамське порося")
else:
    print("Краще вам не заводити домашніх улюбленців.")
